[

    {
        "title": "Food Corporation of India : The road ahead",
        "content": "The Shanta Kumar Committee on restructuring FCI has suggested the reach of the National Food Security Act be curtailed to 40 per cent of the population The National Democratic Alliance government set up the high-level Shanta Kumar Committee to restructure and reform the state-owned Food Corporation of India. Instead, the panel ended up providing a road map to restructure the entire farming and food security policy of the government. In doing so, the panel has re-ignited the debate that ran like a fire in a pine forest through the entire second tenure of the United Progressive Alliance government: should the National Food Security Act be as minimalistic as possible or should it be an expansive reform of the existing public distribution system?
        The Shanta Kumar Committee has made many recommendations on changing what FCI does and how it does it.But it is the big - ticket recommendations on food security that stretch the terms of reference given to the panel to the limits.The panel suggests that in the medium term,
        the country should move towards cash transfers instead of distributing subsidised grain through FCI.This would also mean that the government 's role of buying grain from the farmers at minimum support price will be substantially reduced."
    },

     {
        "title": "A Price Stabilisation Fund to help farmers in distress",
        "content": "Since horticultural produce do not have an MSP, this fund can be used to create linkages and infrastructure Prices of horticultural commodities witness a wide.
        fluctuation in India.There have been instances in the recent past when prices escalated and the produce became unaffordable
        for consumers especially in the
        case ofvegetables such as onion,
        potato and tomato.There have also been cases where farmers could not sell their produce in the mandi and preferred to dump their produce on highways due to low prices.To overcome these problems,
        the Centre’ s recent move to introduce a Price Stabilisation Fund would give a fillip to horticultural production as well as market stabilisation.
        "
    },
    {
        "title": "An IT revolution in farming",
        "content": "Present era is an era of Information and Communication Technology (ICT). It is more interactive and can render information as per the need of ultimate users and.
        ensures the possibility
        for quick information gathering,
        Present era is an era of Information and Communication Technology(ICT).It is more interactive and can render information as per the need of ultimate users and ensures the possibility
        for quick information gathering,
        processing,
        transmission,
        preservation and sharing
        for social,
        economical and cultural upliftment.The growth of technologies in the field of communication leads to global spread of knowledge and application which leaves multi - dimensional impact on all spheres of human activity by accelerating the process of information exchange and reducing the cost involved in achieving the ultimate objectives at farmers field.The information and communication technology can render technical services in agriculture and allied sectors,
        weather information,
        market information,
        global information regarding agriculture,
        state and central agricultural schemes formed
        for the welfare of the farmers.In the country like India,
        the use of information and communication technology is in an ascent stage to help the farmers in taking right decisions at right time to carry out their farm operations.The effectiveness of any organisation depends upon several factors,
        out of which effective communication is one of the most important.Presently the dissemination of the agricultural information is mostly depending on information and communication technologies.
        "    },
       `` {
            "title": "Check soil health before use of fertilisers",
            "content": "A deficient monsoon and a global slump in commodity prices have taken a toll on Indian farmers, who have spent heavily to save standing crops,
but will have to sell their produce at depressed prices. The situation is worse in dry and arid regions of Vidarbha in 
Maharashtra and Telangana, with regular reports of farmer suicides. In an interview, Union agriculture minister Radha Mohan Singh comments on these issues. Edited excerpts: The recently released ‘Key Indicators of Situation of Agricultural Households in India’ shows that the lot of Indian farmers has not changed in the past decade. How will you remedy this situation? Being a farmer, I admit this is the reality. The country might have progressed, but a village and a farmer’s life have not improved. There is no doubt we are self-sufficient in foodgrains production, but we have not addressed problems of low productivity, rising costs of cultivation, lack of irrigation and giving farmers improved varieties. No schemes were taken up in mission mode to solve these issues.
India has 145 million farm holdings. Farmers are not aware of soil health and they blindly use fertilizers. The result is a drop in productivity. Our government has initiated programmes on mission mode to give every farmer a soil health card. We will spend Rs 568 crore in the next three years towards this."
        }


]